Repository: 84000/data-translation-memory
Catalog: toh660-v3.tmx
Source language: bo
Languages: en

source: འཕགས་མ་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས། འཕགས་མ་བཅོམ་ལྡན་འདས་མ་གཟའ་རྣམས་ཀྱི་ཡུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Dhāraṇī The Mother of the Grahas Homage to the blessed noble Mother of the Grahas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་འབྲོག་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བདུད་དང་། གཤིན་རྗེ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། མིག་དམར་དང་། གཟའ་ལྷག་དང་། ཕུར་བུ་དང་། པ་བ་སངས་དང་། སྤེན་པ་དང་། སྒྲ་གཅན་དང་། མཇུག་རིངས་དང་། རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་ལ་སོགས་པ་དུ་མས་བསྟོད་ཅིང་། རྡོ་རྗེ་ཆེན་པོ་དམ་ཚིག་གི་རྒྱན་གྱིས་བྱིན་གྱིས་བརླབས་པའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་དང་ཐབས་ཅིག་པ་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་གཏུམ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་སྡེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་གཞུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་བདག་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་རྒྱན་དང་།
en: The Blessed One was dwelling in Aṭavika’s great city, where he was being praised by a multitude of devas, nāgas, yakṣas, rākṣasas, gandharvas, asuras, garuḍas kinnaras, and mahoragas as well as Māra, Yama, Sūrya, Candra, Aṅgāraka, Budha, Bṛhaspati, Śukra, Śani, Rāhu, Ketu, the twenty-eight nakṣatras, and so forth while seated on a lion throne graced with the ornaments of the great vajra samaya.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་གཟིགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པདྨའི་ཏོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞལ་རས་རྒྱས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པདྨའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པདྨའི་སྤྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་དང་།
en: He was accompanied by a multitude of bodhisattvas and surrounded by many hundreds of members of the saṅgha of bodhisattvas, such as the bodhisattva great being Vajrapāṇi, the bodhisattva great being Vajracaṇḍa, the bodhisattva great being Vajrasena, the bodhisattva great being Vajra Bow, the bodhisattva great being Vajra Master, the bodhisattva great being Vajra Ornament, the bodhisattva great being Vajra Light, the bodhisattva great being Noble Avalokiteśvara, the bodhisattva great being Samantadarśin, the bodhisattva great being Lokaśrī, the bodhisattva great being Lotus Flag, the bodhisattva great being Broad Face, the bodhisattva great being Padmagarbha, the bodhisattva great being Lotus Eyes, the bodhisattva great being Mañjuśrī, the bodhisattva great being Maitreya, and more.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་བརྒྱ་ཕྲག་དུ་མ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཞིང་མདུན་དུ་བདར་ལ་ཆོས་སྟོན་ཏེ།
en: He sat before them teaching the Dharma.

source: བཀོད་པ་ཆེན་པོའི་རྒྱན་ཡིད་བཞིན་གྱི་ནོར་བུ་ཞེས་བྱ་བ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ།
en: He was delivering a Dharma teaching called “A Wish-Fulfilling Jewel Adorning the Great Array” that was good at the beginning, good in the middle, good at the end, excellent in meaning, beautiful in its expression, unadulterated, perfectly pure, and thoroughly erudite.

source: མ་འདྲེས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བའི་ཆོས་སྟོན་པར་མཛད་དོ། །དེ་ནས་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་ལག་ན་རྡོ་རྗེས་འཁོར་དེ་རྣམས་ལ་བལྟས་ནས་ལངས་ཏེ། བདག་གི་རྫུ་འཕྲུལ་གྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ལན་སྟོང་ཕྲག་དུ་མ་བསྐོར་བ་བྱས་ཏེ།
en: Then, through the power of the Buddha, Vajrapāṇi rose from his seat in the assembly, and, through his own magical power, circled the Blessed One many thousands of times, bowed, and sat before him.

source: ཕྱག་འཚལ་ནས་སྤྱན་སྔར་འདུག་སྟེ། སྙེམས་པ་དང་བཅས་པས་སྐྱིལ་མོ་ཀྲུང་ལེགས་པར་བཅས་པས་འཁོར་དེ་རྣམས་ལ་བལྟས་ཏེ། རྡོ་རྗེ་ཐལ་མོ་རང་གི་སྙིང་གར་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With pride, he sat in a perfect cross-legged position gazing at the assembly with his vajra palms placed together at his heart, and addressed the Blessed One.

source: བཅོམ་ལྡན་འདས་གཟའ་རྣམས་ནི་གཏུམ་ཞིང་གཏུམ་པའི་གཟུགས་ཅན།
en: “Blessed One the grahas are vicious and have a vicious nature.

source: དྲག་ཅིང་དྲག་པའི་གཟུགས་ཅན།
en: They are fierce and have a fierce nature.

source: ཁྲོ་ཞིང་ཁྲོ་བའི་སེམས་ཀྱི་སེམས་ཅན་རྣམས་ལ་རྣམ་པར་འཚེ་ཞིང་གནོད་པར་བགྱིད་ལ་མདངས་འཕྲོག་པར་བགྱིད་དེ།
en: They are wrathful, and, because of their wrathful intention, they hurt, harm, and steal the life force of beings.

source: ཁ་ཅིག་ནི་ནོར་རྫས་འཕྲོག་པར་བགྱིད། ཁ་ཅིག་ནི་སྲོག་འཕྲོག་པར་བགྱིད། སེམས་ཅན་ཚེ་རིང་པོ་ཁ་ཅིག་ནི་ཚེ་ཐུང་བར་བགྱིད།
en: Some take wealth, some take life, and some shorten the length of a being’s lifespan.

source: དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་གནོད་པས་འཚེ་བར་བགྱིད་པས་ན། དེའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་གང་གིས་སེམས་ཅན་རྣམས་ལ་བསྲུང་བར་འགྱུར་བ་བཤད་དུ་གསོལ།
en: Will the Blessed One please teach a Dharma discourse that will protect beings from these beings who are harmful and bring misfortune?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་གང་ཁྱོད་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱ་བའི་དོན་དུ་སྙིང་རྗེ་བསྐྱེད་ནས། གསང་བ་ཆེན་པོ་ཤིན་དུ་གསང་བ་དེ་བཞིན་གཤེགས་པ་ལ་ཞུ་བར་བྱེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Well done, Vajrapāṇi,” the Blessed One replied, “it is good that the compassion you have generated for being of benefit to beings has led you to ask the Thus-Gone One about the most secret of secret teachings.

source: དེ་དག་ངས་བཤད་ཀྱིས་ཉོན་ལ་ལེགས་པར་རབ་ཏུ་ཟུངས་ལ་ཡིད་ལ་གྱིས་ཤིག །
en: Please listen, pay attention, and focus as I explain them.

source: གཟའ་རྣམས་གཏུམ་པའི་གཟུགས་ལ་ཤིན་ཏུ་ཁྲོ་ཞིང་འཇིགས་པ་རྣམས་ལ་མཆོད་པ་བཟང་པོ་མཆོད་ཡོན་དང་བཟླས་བརྗོད་བཟང་པོ་གསང་བ་ལས་ཆེས་གསང་བ་ངས་བཤད་པར་བྱའོ། །དེ་དག་མཆོད་པས་མཆོད་འགྱུར་ཞིང་། །གནོད་པ་བྱས་ན་གནོད་བྱེད་པ། །གཟའ་དེ་ཀུན་གྱི་ཁ་དོག་དང་། །ཇི་ལྟར་དགའ་བར་འགྱུར་བ་དང་། །ལྷ་རྣམས་དང་ནི་ལྷ་མིན་དང་། །མིའམ་ཅི་དང་ཀླུ་དག་དང་། །གནོད་སྦྱིན་རྣམས་དང་སྲིན་པོ་དང་། །
en: I will explain the most secret of secret excellent offerings and the excellent recitation for incanting offering water for the grahas who have a vicious nature and are so very wrathful and terrifying.

source: སྲུལ་པོ་དང་ནི་མི་རྣམས་དང་། །དྲག་པོ་གཟི་བརྗིད་ཆེན་པོ་དག །ཁྲོས་པ་ཞི་བར་བྱེད་པ་ཡི། །གསང་སྔགས་རྣམས་དང་མཆོད་པ་དག །རིམ་པ་བཞིན་དུ་བཤད་པར་བྱ། །
en: “I will give a systematic explanation Of worshiping them with the offering rite, Identifying the perpetrator when harm has occurred, The colors of the celestial grahas, “How they can be appeased, And the offerings and mantras That will pacify wrathful Devas, asuras, “Kinnaras, nāgas, Yakṣas, rākṣasas, Pūtanas, and humans Brimming with fierce, fiery energy.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཉིད་ཀྱི་ཐུགས་ཀ་ནས་སྙིང་རྗེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་འོད་ཟེར་འབར་བ་ཕྱུང་ནས། གཟའ་རྣམས་ཀྱི་སྤྱི་བོར་ཞུགས་པར་གྱུར་ཏོ། །
en: A radiant light referred to as “the manifestation of compassion” blazed forth from blessed Śākyamuni’s heart and entered the crowns of the grahas.

source: དེ་ནས་དེ་ཉིད་ཀྱི་སྐད་ཅིག་ཉིད་ལ་ཉི་མ་ལ་སོགས་པའི་གཟའ་རྣམས་ལངས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བདག་ཅག་རྣམས་ལ་སྨན་ཡོན་བཏགས་པར་གྱུར་ཏེ།
en: At that very instant, Sūrya and the rest of the celestial grahas got up and addressed the Blessed One: “The blessed, thus gone, worthy, perfect Buddha has shown us hospitality.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་བསྟན་དུ་གསོལ།
en: Please teach the Dharma discourse, Blessed One.

source: བཅོམ་ལྡན་འདས་གང་གིས་བདག་ཅག་རྣམས་འཚོགས་ནས་ཡོ་བྱད་དུ་གྱུར་པར་བྱེད་པའི་ཆོས་སྨྲ་བ་རྣམས་ལ་བསྲུང་བ་དང་། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་དང་རིམ་གྲོ་དང་ཆད་པ་བཟློག་པ་དང་། མཚོན་ཆ་སྤང་བ་དང་། དུག་གཞིལ་བ་དང་།
en: Will the Blessed One, who has gathered us here, please teach the dharma reciters who act in your service about guarding and protecting themselves, bringing peace and happiness, healing, dispelling punishment, eliminating weapons, neutralizing poison, nullifying poison, establishing a protective boundary, and binding the ground.”

source: དུག་གསད་པ་དང་། མཚམས་བཅད་པ་དང་། ས་བཅིང་བར་འགྱུར་བ་རྣམས་བཤད་དུ་གསོལ། དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་གཟའ་རྣམས་ཀྱི་མཆོད་པ་དང་གསང་སྔགས་བཀའ་སྩལ་པ། ཇི་ལྟ་བའི་རིམ་པའི་ཁ་དོག་གི་དབྱེ་བས་ཕྱོགས་རྣམས་སུ་དྲིའི་དཀྱིལ་འཁོར་བྱས་ལ་པདྨ་སོར་བཅུ་གཉིས་ཀྱི་ཚད་དུ་བྱས་པའི་འདབ་མ་བྲིས་ཏེ།
en: And so, the blessed, thus-gone, worthy, perfect Buddha Śākyamuni taught the offering rites and mantras of the celestial grahas: “One should make a maṇḍala circle in which the directions are illustrated using the particular color that is appropriate for each one.

source: ལྟེ་བ་ཡང་སོར་བཅུ་གཉིས་པ་ལ་སྒོ་བཞིས་མཛེས་པ་རིམ་བཞིན་དུ་བྱས་པ་ལ་པདྨ་རྒྱས་པའི་སྟེང་དུ་ལྷ་ཉི་མ་བསམ་པར་བྱ་བ་ནི་ལུས་གཟི་བརྗིད་ཀྱི་ཕུང་པོ་ལི་ཁྲི་ཉེ་བར་འབར་བ་ལྟ་བུ་ཉི་མ་སྟོང་དང་མཚུངས་པའི་འོད་ཟེར་ཅན་ནོ། །
en: Then, one should draw a lotus on it with petals that are twelve fingers long and a center that is twelve fingers in diameter and decorate the maṇḍala with four gates following the proper procedure—oṁ maigholkāya svāhā. One should imagine Sūrya on top of the blooming lotus. His body is like a blazing orange mass of fiery energy and his radiant light is equal to a thousand suns.

source: ཨོཾ་མཻ་གྷོ་ལྐཱ་ཡ་སྭཱ་ཧཱ། ཤར་དུ་ཟླ་བ་དཀར་པོ།
en: Candra is white and in the east—oṁ śitāṃśave svāhā.

source: ཨོྃ་ཤི་ཏཱྃ་ཤ་བེ་སྭཱ་ཧཱ། མེའི་མཚམས་སུ་མིག་དམར་པོ།
en: Aṅgāraka is red and in the southeast—oṁ raktāṅga­kumārāya svāhā.

source: ཨོཾ་རཀྟཱྃ་ག་ཀུ་མཱ་རཱ་ཡ་སྭཱ་ཧཱ།
en: The kṣatriya Budha is yellow and in the south—oṁ budhāya svāhā.

source: གཤིན་རྗེའི་ཕྱོགས་སུ་རྒྱལ་རིགས་གཟའ་ལྷག་མདོག་སེར་པོ། ཨོྃ་བུདྷཱ་ཡ་སྭཱ་ཧཱ།
en: Aṅgiras is orange and in the southwest—oṁ bṛhaspataye svāhā.

source: བདེན་བྲལ་དུ་ཕུར་བུ་དམར་སེར། ཨོཾ་པྲྀ་ཧ་སྤ་ཏ་ཡེ་སྭཱ་ཧཱ། ནུབ་ཀྱི་ཕྱོགས་སུ་པ་བ་སངས་དཀར་པོ། ཨོཾ་ཨ་སུ་རོཏྟ་མཱ་ཡ་སྭཱ་ཧཱ།
en: Śukra is white and in the west—oṁ asurottamāya svāhā.

source: རླུང་དུ་སྤེན་པ་མིག་སྨན་ལྟར་ཤིན་ཏུ་གནག་པ།
en: Śani is as black as collyrium and in the northwest—oṁ kṛṣṇa­varṇāya svāhā.

source: ཨོཾ་ཀྲྀཥྞ་ཝརྞྞ་ཡ་སྭཱ་ཧཱ། ལུས་ངན་པོའི་ཕྱོགས་སུ་སྒྲ་གཅན་དམར་ནག །ཨོཾ་ཨ་མྲྀ་ཏ་པྲི་ཡཱ་ཡ་སྭཱ་ཧཱ།
en: Rāhu is dark red and in the north—oṁ amṛta­priyāya svāhā.

source: དབང་ལྡན་གྱི་མཚམས་སུ་དུད་སྤྲིན་གྱི་མདོག་ལྟ་བུའི་མཇུག་རེངས། ཨོཾ་ཛྱོ་ཏི་ཀེ་ཏ་བེ་སྭཱ་ཧཱ།
en: Ketu is the color of a cloud of smoke and in the northeast—oṁ jyotiketave svāhā.

source: ཤར་གྱི་སྒོར་རྗེ་བཙུན་སངས་རྒྱས།
en: “The venerable Buddha is at the eastern gate.

source: ལྷོ་སྒོར་ཕྱག་ན་རྡོ་རྗེ།
en: Vajrapāṇi is at the southern gate.

source: ནུབ་སྒོར་འཇིག་རྟེན་མགོན་པོ།
en: Lokanātha is at the western gate.

source: བྱང་གི་སྒོར་འཇམ་དཔལ་ལོ། །
en: Manjuśrī is at the northern gate.

source: དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་གྱི་བྱང་ཤར་དུ་གཟའ་ཐམས་ཅད་དོ། །
en: “For the outer maṇḍala, all the celestial grahas should be depicted in the northeast.

source: ཤར་ལྷོའི་མཚམས་སུ་ཁྱིམ་རྣམས་དང་རྒྱུ་སྐར་རྣམས་སོ། །
en: The lunar mansions and the nakṣatras are in the southeast.

source: ལྷོ་ནུབ་དུ་གནོད་པ་ཐམས་ཅད་དོ། །
en: The upadravas are in the southwest.

source: ནུབ་བྱང་དུ་རྗེ་བཙུན་རིགས་པ་ཆེན་མོའོ། །
en: Venerable Mahāvidyā is in the northwest.

source: དཀྱིལ་འཁོར་གྱི་སྒོའི་ཕྱི་རོལ་གྱི་ཤར་དུ་ཡུལ་འཁོར་སྲུང་།
en: Dhṛtarāṣṭra is in the east at the outer maṇḍala gate.

source: ལྷོར་འཕགས་སྐྱེས་པོ། ནུབ་ཏུ་མིག་མི་བཟང་།
en: Virūḍhaka is in the south.

source: བྱང་དུ་ལུས་ངན་པོའོ། ཉི་མའི་འོ་ཐུག་དང་།
en: Virūpākṣa is in the west.

source: ཟླ་བའི་ཞོ་ཟན་དང་།
en: Kubera is in the north.

source: མིག་དམར་གྱི་སྲན་མ་མ་ཤའི་བཟའ་བ་དང་། ལྷག་པའི་མར་གྱི་ཁུར་བ་དང་། ཕུར་བུའི་འོ་མ་དང་། པ་བ་སངས་ཀྱི་ཁུར་བ་དང་། སྤེན་པའི་སྲན་མ་མ་ཤ་དང་། མུད་ག་བསྲེས་པ་དང་། སྒྲ་གཅན་གྱི་ཏིལ་གྱི་ཐུག་པ་དང་། མཇུག་རིངས་ཀྱི་ཏིལ་ཀྱི་ཐུག་པ་དང་།
en: “There should be kheer for Sūrya, yogurt for Candra, a meal of chickpeas and maṣa beans for Aṅgāraka, ghee for Budha, milk for Bṛhaspati, cake for Śukra, a mixture of chickpeas, maṣa, and mung beans for Śani, sesame kheer for Rāhu, and a soup of sesame kheer and molasses for Ketu.

source: བུ་རམ་གྱི་ཚོད་མའོ། །གནོད་སྦྱིན་གྱི་གཏོར་མ་ནི་ཡུལ་འཁོར་སྲུང་གི་ཞོ་ཟན་ནོ། །འཕགས་སྐྱེས་པོའི་ཞོ་དང་སྲན་མ་མ་ཤའི་བཟའ་བའོ། །མིག་མི་བཟང་གི་འོ་ཐུག་གི་བཟའ་བའོ། །ལུས་ངན་པོའི་ཞོ་དང་སྲན་མ་མ་ཤའི་བཟའ་བ་དང་བུ་རམ་ཆང་དང་སྦྱར་བའོ། །
en: “The bali offering for the yakṣas consists of yogurt for Dṛtarāṣṭra, a dish prepared with yogurt, chickpeas, and maṣa beans for Virūpakṣa, rice pudding for Virūḍhaka, a meal of kheer for Virūpākṣa, and a meal of yogurt, chickpeas, and maṣa beans combined with alcohol and molasses for Kubera.

source: ཇི་ལྟ་བའི་རིམ་པའི་ཁ་དོག་གི་མེ་ཏོག་དབུལ་ལོ། །ཇི་ལྟ་བའི་རིམ་པའི་ཁ་དོག་གི་བདུག་སྤོས་དབུལ་ལོ། །ཇི་ལྟ་བའི་རིམ་པའི་ཁ་དོག་གི་བ་དན་དབུལ་ལོ། །
en: “They should be given the correct type of flowers, the correct type of incense, and the correct type of banner.

source: སོ་སོ་ལ་མར་མེ་དབུལ་ལོ། །ཇི་ལྟ་བའི་རིམ་པའི་མཆོད་པ་བྱའོ། །
en: Then, one should present a lamp to each one and perform the appropriate offering.

source: མར་དང་སྦྲང་རྩིས་དུང་ཕོར་བཀང་སྟེ། རིན་ཆེན་སྣ་ལྔ་བཅུག་ལ་མཆོད་ཡོན་དབུལ་ཞིང་གདོང་ལ་ཡང་དར་བཅིང་བར་བྱའོ། །
en: “One should fill a conch shell with butter and honey, set out the five precious substances and present the offering water, and tie a silk cloth around the mouth.

source: ལག་ན་རྡོ་རྗེ་གཟའ་འདི་རྣམས་ཀྱི་སྙིང་པོའི་སྔགས་བཀླགས་པས་འགྲུབ་པ་རྣམས་ཡིན་ཏེ།
en: “Vajrapāṇi, the following things should be done while reciting the celestial grahas’ heart mantra.

source: ཇི་ལྟ་བའི་རིམ་པའི་ཁ་དོག་དང་མཐུན་པའི་སྤོས་ཀྱི་དཀྱིལ་འཁོར་སོར་བཅུ་གཉིས་པ་བྱས་པའི་དབུས་སུ་མཆོད་པར་བྱའོ། །
en: One should perform the offering in the middle of a maṇḍala that is twelve fingers in diameter and in which the appropriate type of incense is burning.

source: ཁམ་པའམ་ཟངས་ལ་སོགས་པའམ། གསེར་དངུལ་གྱི་སྣོད་དུ་མཆོད་ཡོན་ཕུལ་ནས། རེ་རེ་ལ་ཡང་བཟླས་བརྗོད་ལན་བརྒྱ་རྩ་བརྒྱད་རྩ་བརྒྱད་བྱའོ། །
en: Present the water offering in vessels made of silver and gold or of clay, copper, and so forth, and incant each one of them with the mantra one hundred and eight times.

source: ལག་ན་རྡོ་རྗེ་དེ་ནས་ཡང་དེའི་འོག་ཏུ་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་སྔགས་ཀྱི་ཚིག་རྣམས་ལན་བདུན་བརྗོད་པར་བྱའོ། །
en: “After that, Vajrapāṇi, one should recite the mantra verses of The Dhāraṇī “The Mother of the Grahas” seven times.

source: དེ་ནས་གཟའ་ཉི་མ་ལ་སོགས་པའི་གཟའ་ཐམས་ཅད་ཀྱིས་སྲུང་བར་བྱེད་པར་འགྱུར་རོ། །དབུལ་བའི་གདོན་ལས་གྲོལ་བར་བྱེད་དོ། །
en: All the celestial grahas beginning with Sūrya and so forth will offer their protection and one will be free from the grahas who cause poverty.

source: ཚེ་ཟད་པ་རྣམས་ཚེ་རིང་བར་འགྱུར་རོ། །
en: Those whose lifespan has been shortened will have a long life.

source: ལག་ན་རྡོ་རྗེ་ཡང་གང་ཞིག་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་སམ། སེམས་ཅན་གཞན་སེམས་ཅན་གྱི་སྐྱེ་བར་གཏོགས་པ་གང་དག་གི་རྣ་ལམ་དུ་ཐོས་ན། དེ་དག་ཀྱང་དུས་མ་ཡིན་པར་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ། །
en: “Vajrapāṇi, any monk, nun, male lay practitioner, female lay practitioner, or any other being known to take birth in the realm of beings who hears it will not suffer an unnatural death.

source: ལག་ན་རྡོ་རྗེ་ཡང་གང་ཞིག་གཟའ་རྣམས་ཀྱི་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་མཆོད་ཅིང་། ཉིན་གཅིག་བཞིན་དུ་ཀློག་པར་བྱེད་པའི་ཆོས་སྨྲ་བར་བྱེད་པ་དེ་ལ་གཟའ་རྣམས་ཐམས་ཅད་ཀྱིས་རྣམ་པ་ཐམས་ཅད་དུ་བདག་ཉིད་ཀྱིས་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: Vajrapāṇi, all the celestial grahas will fulfill everything that might be wished for in every way by the Dharma reciter who makes offerings in the center of the celestial grahas’ maṇḍala and recites this dhāraṇī every day.

source: དེའི་རིགས་རྒྱུད་ཀྱི་དབུལ་བ་ཡང་ཉམས་པར་བྱེད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་བཀའ་སྩལ་པ། ན་མོ་བུདྡྷཱ་ཡ། ན་མོ་བཛྲ་དྷ་རཱ་ཡ། ན་མོ་པདྨ་དྷ་རཱ་ཡ། ན་མོ་ཀུ་མཱ་རཱ་ཡ། ན་མོ་གྲ་ཧཱ་ཎཱཾ། སརྦཱ་ཤ་པ་རི་པཱུ་ར་ཀཱ་ནཱྃ། ན་མོ་ན་ཀྵ་ཏྲཱ་ཎཱྃ། ན་མོ་དྭཱ་ད་ཤ་རཱ་ཤི་ནཱྃ། ཏདྱ་ཐཱ། ཨོྃ་བུདྡྷེ་བུདྡྷེ། བཛྲེ་བཛྲེ། པདྨེ་པདྨེ། ས་ར་ས་ར། པྲ་ས་ར་པྲ་ས་ར། སྨ་ར་སྨ་ར། ཀྲཱི་ཌ་ཡ་ཀྲཱི་ཌ་ཡ། མཱ་ར་ཡ་མཱ་ར་ཡ། མཱརྡྷ་ཡ་མཱརྡྷ་ཡ། གྷཱ་ཊ་ཡ་གྷཱ་ཊ་ཡ། སརྦ་བིགྷྣཱྃ། ཀུ་རུ་ཀུ་རུ། མ་མ་ཀཱརྱཱཾ། ཙྪིནྡྷ་ཙྪིནྡྷ། སརྦ་དུཥྚཱཾ། ཀྵཱ་པ་ཡ་ཀྵཱ་པ་ཡ། ཤཱནྟེ་ཤཱནྟེ། དཱནྟེ་དཱནྟེ། དཱ་མ་ཡ་དཱ་མ་ཡ་སྭཱ་ཧཱ། དྲུ་ཏཱན་དརྴ་ཡ། ཨཱཏྨ་ནཾ། རཀྵ་རཀྵ་མཱྃ། སརྦ་སཏྭཱཾཤྩ། སརྦ་གྲ་ཧཱ་ན་ཀྵ་ཏྲ། བི་དྷྭཾ་ས་ནི་བརྟྟ་ཡ། བྷ་ག་བ་ཏི་མ་ཧཱ་མཱ་ཡེ། པྲ་སཱ་ད་ཡ། སརྦ་དུཥྚཾ། ཤོ་དྷ་ཡ་སརྦ་པཱ་པྃ་ཙཎྜེ་ཙཎྜེ། ཏུ་རུ་ཏུ་རུ། ཙཎྜེ་ནི་ཙཎྜེ་ནི། མུ་ཡུ་མུ་ཡུ། མུ་ཙུ་མུ་ཙུ། བ་ཧ་བ་ཧ། ཨུ་གྲེ་ཨུ་གྲ་ཏ་མེ། པཱུ་ར་ཡ་མེ། མ་ནོར་ཐཾ་པ་རི་པཱུ་ར་ཡ། སརྦ་ཏ་ཐཱ་ག་ཏ། ཨ་དྷིཥྛི་ཏེ་ས་མ་ཡེ་སྭཱ་ཧཱ། ཨོཾ་སྭཱ་ཧཱ། ཧཱུྃ་སྭཱ་ཧཱ། ཧྲྀ་སྭཱ་ཧཱ། དྷྲུྃ་སྭཱ་ཧཱ།
en: The impoverished state of their family lineage will be brought to an end.”

source: དྷྲིཾ་སྭཱ་ཧཱ། པདྨ་དྷ་རཱ་ཡ་སྭཱ་ཧཱ། ཨཱ་དི་ཏྱཱ་ཡ་སྭཱ་ཧཱ། སཽ་མཱ་ཡ་སྭཱ་ཧཱ། དྷཱ་ར་ཎཱི་སུ་ཏཱ་ཡ་སྭཱ་ཧཱ། བུ་དྷཱ་ཡ་སྭཱ་ཧཱ། པྲྀ་ཧསྤ་ཏ་ཡེ་སྭཱ་ཧཱ། ཤུ་ཀྲཱ་ཡ་སྭཱ་ཧཱ། ཀྲྀཥྞ་ཝརྞྞཱ་ཡ་སྭཱ་ཧཱ། རཱ་ཧ་བེ་སྭཱ་ཧཱ། ཀེ་ཏ་བེ་སྭཱ་ཧཱ། བུརྡྷཱཡ་སྭཱ་ཧཱ། བཛྲ་དྷ་རཱ་ཡ་སྭཱ་ཧཱ། པདྨ་དྷ་རཱ་ཡ་སྭཱ་ཧཱ། ཀུ་མཱ་རཱ་ཡ་སྭཱ་ཧཱ། སརྦ་གྲ་ཧེ་བྷྱཿསྭཱ་ཧཱ། སརྦ་ནཀྵ་ཏྲེ་བྷྱཿསྭཱ་ཧཱ། སརྦ་དཱ་ད་ཤ་རཱ་ཤི་ནི་བྷྱཿསྭཱ་ཧཱ། སརྦ་ཨུ་པ་དྲ་བེ་བྷྱཿསྭཱ་ཧཱ། ཨོཾ་སརྦ་པིདྱེ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: Then, the blessed Thus-Gone One Śākyamuni recited The Dhāraṇī “The Mother of the Grahas”: namo buddhāya namo vajradharāya namo padma­dharāya namo kumārāya namo grahānāṃ sarvāśa­pari­pūrakānāṃ namo nakṣatrāṇāṃ namo dvādaśa­rāśinām | tadyathā | oṁ buddhe buddhe vajre vajre padme padme sara sara prasara prasara smara smara krīḍaya krīḍaya māraya māraya mārdhaya mārdhaya ghāṭaya ghāṭaya sarva­vighnān kuru kuru mama kāryāṃ cchindha cchindha sarva­duṣṭān kṣāpaya kṣāpaya śānte śānte dānte dānte dāmaya dāmaya svāhā | drutam ādarśaya ātmanaṃ rakṣa rakṣa māṃ sarvasattvāṃś ca sarva­grahāna­kṣatravi­dhvaṃsaṃ nivartaya bhagavati mahāmāye prasādaya sarva­duṣṭaṃ śodhaya sarvapāpaṃ caṇḍe caṇḍe turu turu caṇḍeni caṇḍeni muyu muyu mucu mucu vaha vaha ugre ugrata me pūraya me manoratham pari­pūraya sarva­tathāgatādhiṣṭhite samaye svāhā | oṁ svāhā | hūṁ svāhā | hṛ svāhā | dhruṁ svāhā | dhriṁ svāhā | padma­dharāya svāhā | adityāya svāhā | saumāya svāhā | dhāraṇī­sutāya svāhā | budhāya svāhā | bṛhaspataya svāhā | śukrāya svāhā | kṛṣṇavarṇāya svāhā | rāhave svāhā | ketave svāhā | buddhāya svāhā | vajradharāya svāhā | padmadharāya svāhā | kumārāya svāhā | sarva­grahebhyaḥ svāhā | sarva­nakṣatrebhyaḥ svāhā | sarva­dvādaśa­rāśinibhyaḥ svāhā sarvopdravebhyaḥ svāhā | oṁ sarvavidye hūṁ hūṁ phaṭ phaṭ svāhā | “Vajrapāṇi, the recitation of these mantra verses of The Dhāraṇī “The Mother of the Grahas” should begin on the seventh day during the waxing moon in the autumnal month of Kārtika.

source: ལག་ན་རྡོ་རྗེ་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་སྔགས་ཀྱི་ཚིག་འདི་དག་སྟོན་ཟླ་ཐ་ཆུངས་སྨིན་དྲུག་གི་ཟླ་བའི་ཡར་ངོའི་ཚེས་བདུན་ནས་བརྩམས་ཏེ།
en: One should take temporary vows, perform the offering rite, and recite the dhāraṇī every day until the fourteenth day of the month.

source: གསོ་སྦྱོང་བླངས་ནས་ཚེས་བཅུ་བཞིའི་བར་དུ་ཉིན་གཅིག་བཞིན་དུ་མཆོད་ཅིང་བརྗོད་པར་བྱས་ནས་དེ་ནས་ཉ་ལ་ཉིན་མཚན་ཐོག་ཐག་བཀླགས་ན་དེ་ལ་ལོ་དགུ་བཅུ་རྩ་དགུའི་བར་དུ་འཆི་བའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: If one recites it day and night during the full moon, one will not have to fear death for ninety-nine years.

source: སྐར་མདའ་ལྟུང་བ་དང་། གཟའ་དང་རྒྱུ་སྐར་གྱིས་གདུངས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: One will not fear distress caused by meteors, grahas, and nakṣatras.

source: སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །གཟའ་ཐམས་ཅད་ཀྱིས་མཆོད་པར་འགྱུར་རོ། །གཟའ་རྣམས་ཀྱིས་དེ་ལ་ཅི་འདོད་པའི་མཆོག་སྟེར་བར་འགྱུར་རོ། །
en: One will remember one’s past lives, be worshipped by all the grahas, and the grahas will provide whatever one desires most.”

source: དེ་ནས་གཟའ་དེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ནས་མི་སྣང་བར་གྱུར་ཏོ། །
en: After that, the celestial grahas voiced their approval in agreement with the Blessed One and disappeared.

source: འཕགས་མ་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་རྫོགས་སོ།། །།
en: This concludes The Noble Dhāraṇī “The Mother of the Grahas.”

source: རྒྱལ་བློན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐུ་རིང་ལ་བསྒྱུར་བ་ལས།
en: This was translated during the lifetimes of the king, the minister, and the bodhisattva.

source: དུས་ཕྱིས་དགེ་བསྙེན་གྲགས་པ་རྒྱལ་མཚན་གྱིས་དཔལ་ལྡན་ས་སྐྱའི་དབེན་གནས་སུ་རྒྱ་དཔེ་ལ་གཏུགས་ནས་ཤིན་ཏུ་དག་པར་བྱས་པའོ།། །།
en: Then, at a later date, the lay practitioner Drakpa Gyaltsen corrected it based on an Indian manuscript that was housed at the glorious hermitage of Sakya.
